{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "input_dtype": "float32", "activity_regularizer": null, "nb_col": 3, "name": "convolution2d_1", "activation": "linear", "dim_ordering": "tf", "nb_filter": 32, "subsample": [1, 1], "batch_input_shape": [null, 28, 28, 1], "trainable": true, "b_regularizer": null, "nb_row": 3, "W_constraint": null, "border_mode": "valid", "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 32, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "border_mode": "valid", "bias": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "output_dim": 128, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "W_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "output_dim": 10, "trainable": true, "b_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "W_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}]}